# შექმენით სია , სადაც გექნებათ ნებისმიერი ტიპის ელემენტები მინიმუმ 5 ელემენტი , შემდეგ:
#   1)ამ სიაში დაამატე ახალი ელემენტი ბოლოში
#   2)ჩასვი რიცხვი 8 მე3 ინდექსზე
#   3)წაშალე მეორე ელემენტი
#   4)ამოიღე ბოლო ელემენტი და შეინახე ცალკე ცვლადში და დაბეჭდე
#   5)შეატრიალე სია
#   6)ბოლოს დაბეჭდე

# list = [True, False, 13, 45, "cat", "dog", 13.7, 12.8]
# list.append(13)
# list.insert(4, 8)
# list.remove(False)
# list.pop(7)
# list.reverse()
# print(list)



# მომხარებელს შეაქმნევინეთ სია , გამოიყენეთ ინფუთები
list = []
for i in range(4):
    list.append(input("enter your word or number or word here: "))
print(list)


