# ახსენით რას აკეთებს append მეთოდი და მოიყვანეთ მაგალითი
# append სიის ბოლოში ამატებს ახალ ელემენტს მაგალითად:

list = [12, 23, 45, 56, 34]
list.append("dog")
print(list)


# შექმენით ცარიელი სია. append მეთოდის გამოყენებით დაამატეთ მასში 5 სხვადასხვა რიცხვი და დაპრინტეთ სია
list = []
list.append(23)
list.append(45)
list.append(56)
list.append(87)
list.append(98)
print(list)



# შექმენით სია სიტყვებით. remove მეთოდის გამოყენებით წაშალეთ ერთ-ერთი სიტყვა და დაპრინტეთ შედეგი
list = ["cat", "car", "apple", "html"]
list.remove("cat")
print(list)


# ახსენით განსხვავება remove და pop მეთოდებს შორის
# remove ცვლადის ელემენტებს შლის
# pop ცვლადის ელემენტებს შლის მაგრამ ცალკე ბეჭდავს




# შექმენით სია. insert მეთოდის გამოყენებით ჩასვით ახალი ელემენტი სიის შუაში
list = [23, 34, 56, "cat", "dog", True]
list.insert(3, "hi")
print(list)

# შექმენით რიცხვების სია. sort მეთოდის გამოყენებით დაალაგეთ ეს სია და დაბეჭდეთ შედეგი
list = [23, 45, 68, 89, 90, 10, 34, 40]
list.sort()
print(list)

# ახსენით როგორ მუშაობს reverse მეთოდი და მოიყვანეთ მაგალითი
# reverse აბრუნებს სიაში მყოფ ელემენტსბს მაგალითდ:
list = [12, 34, 65, 78, 98, 9, 5, 87]
list.reverse()
print(list)

# შექმენით სია სიტყვებით. reverse მეთოდის გამოყენებით შეცვალეთ ელემენტების რიგი
list = ["cat", "car", "apple", "html", "dog"]
list.reverse()
print(list)

# შექმენით სია და გამოიყენეთ clear მეთოდი. რა შედეგი მიიღეთ?
list = [56, 78, 34, 56, 35, 38, 87, 98, 43]
list.clear()
print(list)
# ლისტში ელემენტები წაიშალა
# შექმენით სია რიცხვებით. გამოიყენეთ index მეთოდი, რომ იპოვოთ კონკრეტული რიცხვის ინდექსი
list = [12, 34, 65, 78, 98, 9, 5, 87]
print(list.index(9))


# შექმენით სია სიტყვებით. მომხმარებელს მოთხოვეთ რაიმე სიტყვა.
#   - თუ ეს სიტყვა არის სიაში იპოვეთ რომელ ინდექსზე დგას ეს სიტყვა
#   - სხვა შემთხვევაში დაპრინტეთ 'ვერ მოიძებნდა'
# ეს ვერ გავიგე


# შექმენით ცარიელი სია. მომხმარებელს მოთხოვეთ 10 რიცხვი და დაამატეთ ისინი ამ სიაში.
list = []
for i in range(10):
    list.append(int(input("enter number here: ")))
print(list)

# შექმენით ცარიელი სია. მომხმარებელს მოთხოვეთ 7 რიცხვი და დაამატეთ ისინი ამ სიაში. დაპრინტეთ ამ რიცხვებიდან უდიდესი და უმცირესი რიცხვები
# ვერ გავიგე


# (|HARD|) შექმენით ცარიელი სია. მომხმარებელს სათითაოდ მოთხოვეთ 10 რიცხვი. სიაში დაამატეთ რიცხვი თუ: 
#   - დადებითია და არის ლუწი
#   - უარყოფითია და არის კენტი
# საბოლოოდ გაიგეთ ამ რიცხვების საშუალო
# ვერ გავიგე

