# ახსენით რა არის mutable და immutable?
# mutable - შეცვლადი მნიშვნელობა
# immutable - უცვლადი მნიშვნელობა


# ახსენით რას აკეთებს len ფუნქცია
# len - ითვლის რამდენი სიმბოლოა ჩვენს წინადადებაში


# შექმენით ცვლადი სადაც შეინახავთ რაიმე სიტყვას. დაპრინტეთ რამდენი სიმბოლოა ამ სიტყვაში
word = "Apple"
print(len(word))


# შექმენით ცვლადი სადაც მომხმარებელს შემოაყვანინებთ რაიმე წინადადაებას. დაპრინტეთ სიმბოლოების რაოდენობა ამ წინადადებაში
word = input("enter your word here: ")
print(len(word))


# შექმენით სია სადაც შეინახავთ რიცხვებს. for loop ის გამოყენებით დაითვალეთ რამდენი დადებითი და რამდენი უარყოფითი რიცხვია ამ სიაში
# ვერ გავიგე





# შექმნეით სია სადაც შეინახავთ რიცხვებს. დაითვალეთ რამდენი რიცხვი არის ამ სიაში ისეთი, რომელიც იყოფა 5-ზე
numbers = [12, 30, 44, 53, 65, 73, 85]
for i in range(len(numbers)):
     if numbers[i] % 5 == 0:
        print(numbers[i])



# შექმენით სია სადაც შეინახავთ რიცხვებს. დაპრინტეთ მხოლოდ ისეთი რიცხვები, რომლებიც იყოფა 4-ზეც და 7-ზეც
numbers = [28, 34, 43, 54, 61, 75, 86]
for i in range(len(numbers)):
     if numbers[i] % 4 and 7== 0:
        print(numbers[i])


# შექმენით სია სადაც შეინახავთ ნებისმიერ მნიშვნელობებს. დაპრინტეთ მხოლოდ ის ელემენტები, რომლებიც იმყოფებიან ლუწ ინდექსზე
# ეს ვერ  გავიგე

# შექმენით სია სადაც შეინახავთ სიტყვებს. დაითვალეთ იმ სიტყვების რაოდენობა, რომელთა სიგრძეც მეტია 5-ზე
# ეს ვერ გავიგე

# შექმენით ცვლადი, რომელშიც შეინახავთ რაიმე წინადადებას. for ლუპის გამოყენებით დაპრინტეთ თითოეული სიმბოლო
word = ["apple and banana"]
for i in range(len(word)):
    print(len(word[i]))


# შექმენით ცვლადი, რომელშიც შეინახავთ რაიმე წინადადებას. for ლუპის გამოყენებით დაპრინტეთ თითოეული სიმბოლო გარდა გამოტოვებისა
# ეს ვერ გავიგე

# შექმენით სია სადაც შეინახავთ სიტყვებს. for ლუპის გამოყენებით დაპრინტეთ: 'სიტყვა - სიგრძე'
# ეს ვერ გავიგე