# 100 დან 400 მდე დაპრინტეთ ყველა რიცხვი, რომელიც:
#   - იყოფა 5-ზე
#   - მაგრამ არ იყოფა 3-ზე
#   (გააკეთეთ ორ ვარიანტში):
#   - for ციკლით
#   - while ციკლით


for i in range(100, 400):
    if i % 5 == 0 and i % 3 != 0:
        print(i)


i = 100

while i < 400:
    if i % 5 == 0 and i % 3 != 0:
        print(i)
    i = i + 1


# 1 დან 100 მდე დაპრინტეთ ყველა რიცხვი:
#   - თუ რიცხვი იყოფა 2-ზე და 5-ზე --> `EvenFive`
#   - თუ მხოლოდ 2-ზე იყოფა --> `Even`
#   - თუ მხოლოდ 5-ზე იყოფა --> `Five`
#   - სხვა შემთხვევაში --> თავად რიცხვი


for i in range(1, 100):
    if i % 2 == 0 and i % 5 == 0:
        print("EvenFive")
    elif i % 2 == 0:
        print("Even")
    elif i % 5 == 0:
        print("five")
    else:
        print(i)




# მომხმარებელს შემოატანინეთ 8 რიცხვი და:
#   - იპოვეთ მაქსიმალური რიცხვი
#   - იპოვეთ მინიმალური რიცხვი
#   - დაბეჭდეთ ორივე

# ეს ვერ გავიგე





# მომხმარებელს შემოატანინეთ რიცხვი N და:
#   - დათვალეთ რამდენი რიცხვია 1-დან N-მდე, რომელიც იყოფა 3-ზე
#   - შედეგი დაბეჭდეთ


n = int(input("enter number here: "))

for i in range(1, n):
    if i % 3 == 0:
        print(i)




# დაპრინტეთ 1 დან 50 მდე რიცხვები, მაგრამ:
#   - თუ რიცხვი იყოფა 4-ზე --> არ დაპრინტოთ (გამოტოვეთ)
#   - დანარჩენი რიცხვები დაბეჭდეთ


for i in range(1, 50):
    if i % 4 != 0:
        print(i)
    




# შექმენით პროგრამა, რომელიც მომხმარებელს რიცხვებს შემოატანინებს მანამ, სანამ უარყოფით რიცხვს არ შეიყვანს:
#   - დაითვალეთ შეყვანილი რიცხვების ჯამი
#   - ბოლოს დაბეჭდეთ ეს ჯამი


# ეს ვერ გავიგე

# ააგეთ ვებსაიტი ყველა განვლილი მასალით:
#   - კლავიატურაზე
#   - საღეჭ რეზინაზე
#   - მოთხრობებზე
#   - მაიმუნზე
#   - ხეებზე
#   - ან რაც თქვენ გინდათ