# შექმენი სია, სადაც შეინახავ შენს საყვარელ ფერებს.
Colours = ["red", "blue", "black"]
print(Colours)

# შექმენი სია, სადაც შეინახავ კვირის დღეებს.
Week_Days = ["monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday"]

# შექმენი სია, სადაც შეინახავ 5 სხვადასხვა რიცხვს. -> დაბეჭდე მესამე ინდექსზე მყოფი ელემენტი

Numbers = [15, 16, 17, 18, 19, 20]
if Numbers == 18:
    Numbers[3] = 21
print(Numbers)




# შექმენი სია, სადაც შეინახავ 5 ქალაქის სახელს. -> შეცვალე მეორე ინდექსზე მყოფი ელემენტი სხვა ქალაქით
Cities = ["batumi", "zugdidi", "tbilisi", "berlin", "moskow"]
if Cities[2] == "tbilisi":
    Cities[2] = "qutaisi"
print(Cities)


# შექმენი სია, სადაც შეინახავ შენი ოჯახის წევრების სახელებს. -> დაბეჭდე პირველი და ბოლო ელემენტი (ინდექსებით)
# es ver gavige

# შექმენი სია, სადაც შეინახავ 6 სხვადასხვა რიცხვს. -> შეცვალე მეოთხე ინდექსზე მყოფი ელემენტი 100-ით
numbers = [21, 22, 23, 24, 25, 26]
if numbers[4] == 25:
    numbers[4] = 100
print(numbers)



# შექმენი სია, სადაც შეინახავ 10 ძაღლის სახელს. -> შეცვალე მეხუთე ელემენტი სხვა თამაშით
Dog_Names = ["Otis", "Ace", "Finn", "Gus", "Ben", "Gizmo", "Blue", "Bo", "Jax", "Hank"]
if Dog_Names[5] == "Gizmo":
    Dog_Names[5] = "Roblox"
print(Dog_Names)


# შექმენი სია, სადაც შეინახავ 3 სტრინგს, 3 რიცხვს და 3 ბულეანს. -> დაბეჭდე ნებისმიერი ერთი ელემენტი ინდექსის გამოყენებით
Attributs = ["cat", "car", "cow", 15, 16, 17, True, False, True]
print(Attributs[2])


# შექმენი სია, სადაც შეინახავ 5 მუსიკოსის სახელს. -> თუ პირველი ელემენტი არის 'Drake' -> შეცვალე სხვა მუსიკოსით
Musisikians = ["mozart", "Drake", "led zeppelin", "michael jackson", "taylor swift"]
if Musisikians[1] == "Drake":
    Musisikians[1] = "bruno mars"
print(Musisikians)


# შექქმენი სია, სადაც შეინახავ რიცხვებს(როგორც მთელები ისე არამთელები) -> გაზარდე სიის პირველი და ბოლო ელემენტი 1000-ით
#es ver gavige


# შექმენი სია, სადაც შეინახავ 3 რიცხვს(როგორც მთელები ისე არამთელები)
#   - თუ პირველი რიცხვი არის მეტი 10-ზე:
#       გაზარდე სიის მესამე ელემენტი პირველი და მეორე ელემენტის ნამრავლით
#   - სხვა შემთხვევაში:
#       გაზარდე სიის პირველი ელემენტი მეორე და მესამე ელემენტის ნამრავლით
# es ver gavige