# ახსენით რას აკეთებს lower მეთოდი და მოიყვანეთ მაგალითი
# აპატარავებს ასოებს
name = "GABRIELI"
print(name.lower())


# შექმენით სტრინგი დიდი ასოებით. lower მეთოდის გამოყენებით გადააკეთეთ ყველა ასო პატარად და დაპრინტეთ შედეგი
pet = "DOG"
print(pet.lower())


# ახსენით რას აკეთებს upper მეთოდი და მოიყვანეთ მაგალითი
# ადიდებს ასოებს
name = "gabrieli"
print(name.upper())


# მომხმარებელს შემოატანინეთ სიტყვა. upper მეთოდის გამოყენებით გადააკეთეთ ეს სიტყვა დიდ ასოებად
word = input("enter your word here: ")
print(word.upper())


# ახსენით რას აკეთებს title მეთოდი და მოიყვანეთ მაგალითი
# ადიდებს პირველ ასოს
name = "gabrieli"
print(name.title())


# შექმენით სტრინგების სია. გამოიყენეთ title მეთოდი თითოეულ სტრინგზე
# ეს ვერ გავიგე


# შექმენით სტრინგი. count მეთოდის გამოყენებით დაითვალეთ რამდენჯერ გვხვდება კონკრეტული ასო
name = "gabrieli"
print(name.count("a"))


# მომხმარებელს შემოატანინეთ წინადადება და ერთი სიმბოლო. count მეთოდის გამოყენებით გაიგეთ რამდენჯერ გვხვდება ეს სიმბოლო წინადადებაში
word = input("Enter word and symbol here: ")
symbol = input("Enter symbol: ")
print(word.count(symbol))



# მომხმარებელს შემოატანინეთ სახელი და გვარი. title მეთოდის გამოყენებით სწორ ფორმატში დაპრინტეთ ორივე.
name_surname = input("Enter name and surname here: ")
print(name_surname.title())


# მომხმარებელს შემოატანინეთ წინადადება(დიდი ასოებითაც და პატარებითაც). დათვალეთ ხმოვნების რაოდენობა.
# ეს ვერ გავიგე


# მომხმარებელს შემოატანინეთ წინადადება(დიდი ასოებითაც და პატარებითაც).
#   - გაიგეთ დიდი ასოების პროცენტული რაოდენობა სტრინგში
#   - გაიგეთ პატარა ასოების პროცენტული რაოდენობა სტრინგში
#   - გაიგეთ ხმოვანი ასოების პროცენტული რაოდენობა სტრინგში
#   - გაიგეთ თანხმოვანი ასოების პროცენტული რაოდენობა სტრინგში
#   - გაიგეთ სფეისების პროცენტული რაოდენობა სტრინგში
# ეს ვერ გავიგე