# 1) შექმენით სია სადაც შეინახავთ რაიმე რიცხვებს, მთელებიც და არამთელებიც.
#   - თქცენი დავალებაა შექმნათ ფუნქცია, რომელიც მიიღებს არგუმენტად სიას.
#   - თქვენმა ფუნქციამ უნდა დაპრინტოს მინიმალური და მაქსიმალური რიცხვები (გამოიყენეთ f string)
#   - და უნდა დააბრუნოს ამ რიცხვების კამი


numbers_list = [12, 4.5, 67, 0.2, -5, 18.9, 100, -2.4]

def analyze_numbers(list):
    min_val = min(list)
    max_val = max(list)
    print(f"მინიმალური რიცხვია: {min_val}")
    print(f"მაქსიმალური რიცხვია: {max_val}")
    return sum(list)


total_sum = analyze_numbers(numbers_list)
print(f"სიის წევრების ჯამია: {total_sum}")